The highlighted wall cannot be joined to the highlighted roof because the wall meets the roof tangentially.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId WallMeetsRoofTangentially { get; }
  Visual Basic
Public Shared ReadOnly Property WallMeetsRoofTangentially As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ WallMeetsRoofTangentially {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures WallJoinRoofFailures Class
  Autodesk.Revit.DB Namespace